In [47]:
import pandas as pd

In [48]:
df=pd.read_csv("Employee_Salary_Dataset.csv")

In [49]:
df.shape

(35, 5)

In [50]:
df.describe()

              ID  Experience_Years        Age        Salary
count  35.000000          35.00000  35.000000  3.500000e+01
mean   18.000000           9.20000  35.485714  2.059147e+06
std    10.246951           7.55295  14.643552  3.170124e+06
min     1.000000           1.00000  17.000000  3.000000e+03
25%     9.500000           2.50000  22.500000  2.250000e+04
50%    18.000000           6.00000  29.000000  2.500000e+05
75%    26.500000          15.00000  53.500000  3.270000e+06
max    35.000000          27.00000  62.000000  1.000000e+07

In [51]:
df.head()

   ID  Experience_Years  Age  Gender  Salary
0   1                 5   28  Female  250000
1   2                 1   21    Male   50000
2   3                 3   23  Female  170000
3   4                 2   22    Male   25000
4   5                 1   17    Male   10000

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 35 entries, 0 to 34
Data columns (total 5 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   ID                35 non-null     int64
 1   Experience_Years  35 non-null     int64
 2   Age               35 non-null     int64
 3   Gender            35 non-null     object
 4   Salary            35 non-null     int64
dtypes: int64(4), object(1)
memory usage: 1.5+ KB

In [53]:
df.isna().sum()

ID                  0
Experience_Years    0
Age                 0
Gender              0
Salary              0
dtype: int64

In [54]:
df2=df.groupby("Gender")

In [55]:
for male,female in df2:
    print(male)
    print(female)

Female
    ID  Experience_Years  Age  Gender    Salary
0    1                 5   28  Female    250000
2    3                 3   23  Female    170000
6    7                19   54  Female    800000
7    8                 2   21  Female      9000
8    9                10   36  Female     61500
9   10                15   54  Female    650000
10  11                 4   26  Female    250000
15  16                 4   27  Female     87000
16  17                10   34  Female    930000
17  18                15   54  Female   7900000
23  24                 1   21  Female      6000
24  25                 4   23  Female      8900
25  26                 3   22  Female     20000
27  28                27   62  Female  10000000
28  29                19   54  Female   5000000
29  30                 2   21  Female      6100
32  33                20   55  Female   1540000
33  34                19   53  Female   9300000
Male
    ID  Experience_Years  Age Gender   Salary
1    2                 1   21   Male    50000
3    4                 2   22   Male    25000
4    5                 1   17   Male    10000
5    6                25   62   Male  5001000
11  12                 6   29   Male  1400000
12  13                14   39   Male  6000050
13  14                11   40   Male   220100
14  15                 2   23   Male     7500
18  19                 2   21   Male    15000
19  20                10   36   Male   330000
20  21                15   54   Male  6570000
21  22                 4   26   Male    25000
22  23                 5   29   Male  6845000
26  27                 1   18   Male     3000
30  31                10   34   Male    80000
31  32                15   54   Male   900000
34  35                16   49   Male  7600000

In [56]:
df2=df[["Age","Salary"]].groupby(df["Gender"])

In [57]:
df2.mean()

              Age        Salary
Gender
Female  37.111111  2.054917e+06
Male    33.764706  2.063626e+06

In [58]:
df2.min()

        Age  Salary
Gender
Female   21    6000
Male     17    3000

In [59]:
df2.max()

        Age    Salary
Gender
Female   62  10000000
Male     62   7600000

In [60]:
df2.median()

         Age    Salary
Gender
Female  31.0  250000.0
Male    29.0  220100.0

In [61]:
df2.std()

              Age        Salary
Gender
Female  15.449686  3.450120e+06
Male    13.997899  2.950974e+06

In [62]:
# Assuming df is your original DataFrame
df2 = df.groupby("Gender")[["Age", "Salary","Gender"]].agg(pd.Series.mode)

# Reset the index to have a clean DataFrame
result = df2.reset_index(drop=True)

In [63]:
result

            Age  Salary  Gender
0            54  250000  Female
1  [21, 29, 54]   25000    Male